courses = {'CS101': [3004, 'Хайнс', '8:00'], 'CS102': [4501, 'Альварадо', '9:00'], 'CS103': [6755, 'Рич', '10:00'],
           'NT110': [1244, 'Берк', '11:00'], 'CM241': [1411, 'Ли', '13:00']}
num = input()
print('{0}: {1}, {2}, {3}'.format(num, courses[num][0], courses[num][1], courses[num][2]))


courses = {
    "CS101": (3004, 'Хайнс', '8:00'),
    "CS102": (4501, 'Альварадо', '9:00'),
    "CS103": (6755, 'Рич', '10:00'),
    "NT110": (1244, 'Берк', '11:00'),
    "CM241": (1411, 'Ли', '13:00')
}

s = input()
print('{}: {}, {}, {}'.format(s, *courses[s]))